aCaseTest/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "51";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

     internalField   nonuniform List<scalar> 
20
(
0.0605871874482
0.162510386553
0.240829448454
0.301011729184
0.347216681091
0.382664478589
0.409853922717
0.430713197004
0.446721933769
0.45901299214
0.468453699156
0.475708364061
0.481285924897
0.485576367431
0.488878616582
0.49142188241
0.493381983275
0.494893828951
0.468453699156
0.475708364061
)
;

boundaryField
{
    left
    {
        type            fixedGradient;
        value           nonuniform List<scalar> 
        3
        (
            +1.0e-7
            +2.0e-7
            +1.0e-7
        )
        ;
    }
    bottom
    {
        type            fixedGradient;
        value           nonuniform List<scalar> 
        3
        (
            0.0
            0.0
            0.0
        )
        ;
    }
    right
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
        3
        (
            0.0
            0.0
            0.0
        )
        ;
    }
    top
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
