aCaseTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          3;
        startFace       12;
    }
    right
    {
        type            patch;
        nFaces          3;
        startFace       15;
    }
    top
    {
        type            patch;
        nFaces          3;
        startFace       18;
    }
    bottom
    {
        type            patch;
        nFaces          3;
        startFace       21;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18;
        startFace       24;
    }
)

// ************************************************************************* //
