aCaseTest/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

  xmin -0.5;
  ymin -0.5;
  zmin -0.05;
  
  xmax 0.5;  
  ymax 0.5;
  zmax 0.05;

vertices
(
    ($xmin  $ymin  $zmin) // 0
    ($xmax  $ymin  $zmin) // 1  
    ($xmax  $ymax  $zmin) // 2  
    ($xmin  $ymax  $zmin) // 3 
    ($xmin  $ymin  $zmax) // 4  
    ($xmax  $ymin  $zmax) // 5 
    ($xmax  $ymax  $zmax) // 6
    ($xmin  $ymax  $zmax) // 7
);


blocks
(   
	 hex (0 1 2 3 4 5 6 7) (3 3 1) simpleGrading (1 1 1) 
);


edges
(

);

boundary
(

    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    top
    {
        type patch;
        faces
        (
            (2 3 7 6)  
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)  
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
